
  #### Terraform Plan Validate All 📖: `success`
  Plan File: `tmp_plan/envs-shared.plan`

  <details><summary>Show Plan</summary>

  ```

  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # github_actions_secret.secrets["bootstrap.PROJECT_ID"] will be created
  + resource "github_actions_secret" "secrets" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "gcp-infrastructure"
      + secret_name     = "PROJECT_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.secrets["bootstrap.TF_VAR_gh_token"] will be created
  + resource "github_actions_secret" "secrets" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "gcp-infrastructure"
      + secret_name     = "TF_VAR_gh_token"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.secrets["env.SERVICE_ACCOUNT_EMAIL"] will be created
  + resource "github_actions_secret" "secrets" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "gcp-infrastructure"
      + secret_name     = "SERVICE_ACCOUNT_EMAIL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.secrets["env.TF_BACKEND"] will be created
  + resource "github_actions_secret" "secrets" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "gcp-infrastructure"
      + secret_name     = "TF_BACKEND"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.secrets["env.TF_VAR_gh_token"] will be created
  + resource "github_actions_secret" "secrets" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "gcp-infrastructure"
      + secret_name     = "TF_VAR_gh_token"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.secrets["env.WIF_PROVIDER_NAME"] will be created
  + resource "github_actions_secret" "secrets" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "gcp-infrastructure"
      + secret_name     = "WIF_PROVIDER_NAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.secrets["net.PROJECT_ID"] will be created
  + resource "github_actions_secret" "secrets" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "gcp-infrastructure"
      + secret_name     = "PROJECT_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.secrets["net.SERVICE_ACCOUNT_EMAIL"] will be created
  + resource "github_actions_secret" "secrets" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "gcp-infrastructure"
      + secret_name     = "SERVICE_ACCOUNT_EMAIL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.secrets["net.TF_VAR_gh_token"] will be created
  + resource "github_actions_secret" "secrets" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "gcp-infrastructure"
      + secret_name     = "TF_VAR_gh_token"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.secrets["net.WIF_PROVIDER_NAME"] will be created
  + resource "github_actions_secret" "secrets" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "gcp-infrastructure"
      + secret_name     = "WIF_PROVIDER_NAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.secrets["org.PROJECT_ID"] will be created
  + resource "github_actions_secret" "secrets" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "gcp-infrastructure"
      + secret_name     = "PROJECT_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.secrets["org.SERVICE_ACCOUNT_EMAIL"] will be created
  + resource "github_actions_secret" "secrets" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "gcp-infrastructure"
      + secret_name     = "SERVICE_ACCOUNT_EMAIL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.secrets["org.WIF_PROVIDER_NAME"] will be created
  + resource "github_actions_secret" "secrets" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "gcp-infrastructure"
      + secret_name     = "WIF_PROVIDER_NAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.secrets["proj.PROJECT_ID"] will be created
  + resource "github_actions_secret" "secrets" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "gcp-infrastructure"
      + secret_name     = "PROJECT_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.secrets["proj.SERVICE_ACCOUNT_EMAIL"] will be created
  + resource "github_actions_secret" "secrets" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "gcp-infrastructure"
      + secret_name     = "SERVICE_ACCOUNT_EMAIL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.secrets["proj.WIF_PROVIDER_NAME"] will be created
  + resource "github_actions_secret" "secrets" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "gcp-infrastructure"
      + secret_name     = "WIF_PROVIDER_NAME"
      + updated_at      = (known after apply)
    }

  # google_billing_account_iam_member.billing_account_sink must be replaced
-/+ resource "google_billing_account_iam_member" "billing_account_sink" {
      ~ billing_account_id = "0102AD-2D118D-FFFFD8" -> jsonencode(
            {
              + billing_project        = "prj-b-seed-8e7f"
              + create_optional_groups = false
              + create_required_groups = false
              + optional_groups        = {
                  + gcp_global_secrets_admin = ""
                  + gcp_kms_admin            = ""
                  + gcp_network_viewer       = ""
                  + gcp_scc_admin            = ""
                  + gcp_security_reviewer    = ""
                }
              + required_groups        = {
                  + audit_data_users     = "gcp-audit-data@deepbreathe.ai"
                  + billing_data_users   = "gcp-billing-data@deepbreathe.ai"
                  + group_billing_admins = "gcp-billing-admins@deepbreathe.ai"
                  + group_org_admins     = "gcp-organization-admins@deepbreathe.ai"
                }
            }
        )
      ~ etag               = "BwY8NqvJ+pw=" -> (known after apply)
      ~ id                 = "0102AD-2D118D-FFFFD8/roles/logging.configWriter/serviceAccount:sa-terraform-org@prj-b-seed-8e7f.iam.gserviceaccount.com" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # google_billing_account_iam_member.billing_admin_user["bootstrap"] must be replaced
-/+ resource "google_billing_account_iam_member" "billing_admin_user" {
      ~ billing_account_id = "0102AD-2D118D-FFFFD8" -> jsonencode(
            {
              + billing_project        = "prj-b-seed-8e7f"
              + create_optional_groups = false
              + create_required_groups = false
              + optional_groups        = {
                  + gcp_global_secrets_admin = ""
                  + gcp_kms_admin            = ""
                  + gcp_network_viewer       = ""
                  + gcp_scc_admin            = ""
                  + gcp_security_reviewer    = ""
                }
              + required_groups        = {
                  + audit_data_users     = "gcp-audit-data@deepbreathe.ai"
                  + billing_data_users   = "gcp-billing-data@deepbreathe.ai"
                  + group_billing_admins = "gcp-billing-admins@deepbreathe.ai"
                  + group_org_admins     = "gcp-organization-admins@deepbreathe.ai"
                }
            }
        )
      ~ etag               = "BwY8NqvJ+pw=" -> (known after apply)
      ~ id                 = "0102AD-2D118D-FFFFD8/roles/billing.admin/serviceAccount:sa-terraform-bootstrap@prj-b-seed-8e7f.iam.gserviceaccount.com" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # google_billing_account_iam_member.billing_admin_user["env"] must be replaced
-/+ resource "google_billing_account_iam_member" "billing_admin_user" {
      ~ billing_account_id = "0102AD-2D118D-FFFFD8" -> jsonencode(
            {
              + billing_project        = "prj-b-seed-8e7f"
              + create_optional_groups = false
              + create_required_groups = false
              + optional_groups        = {
                  + gcp_global_secrets_admin = ""
                  + gcp_kms_admin            = ""
                  + gcp_network_viewer       = ""
                  + gcp_scc_admin            = ""
                  + gcp_security_reviewer    = ""
                }
              + required_groups        = {
                  + audit_data_users     = "gcp-audit-data@deepbreathe.ai"
                  + billing_data_users   = "gcp-billing-data@deepbreathe.ai"
                  + group_billing_admins = "gcp-billing-admins@deepbreathe.ai"
                  + group_org_admins     = "gcp-organization-admins@deepbreathe.ai"
                }
            }
        )
      ~ etag               = "BwY8NqvJ+pw=" -> (known after apply)
      ~ id                 = "0102AD-2D118D-FFFFD8/roles/billing.admin/serviceAccount:sa-terraform-env@prj-b-seed-8e7f.iam.gserviceaccount.com" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # google_billing_account_iam_member.billing_admin_user["net"] must be replaced
-/+ resource "google_billing_account_iam_member" "billing_admin_user" {
      ~ billing_account_id = "0102AD-2D118D-FFFFD8" -> jsonencode(
            {
              + billing_project        = "prj-b-seed-8e7f"
              + create_optional_groups = false
              + create_required_groups = false
              + optional_groups        = {
                  + gcp_global_secrets_admin = ""
                  + gcp_kms_admin            = ""
                  + gcp_network_viewer       = ""
                  + gcp_scc_admin            = ""
                  + gcp_security_reviewer    = ""
                }
              + required_groups        = {
                  + audit_data_users     = "gcp-audit-data@deepbreathe.ai"
                  + billing_data_users   = "gcp-billing-data@deepbreathe.ai"
                  + group_billing_admins = "gcp-billing-admins@deepbreathe.ai"
                  + group_org_admins     = "gcp-organization-admins@deepbreathe.ai"
                }
            }
        )
      ~ etag               = "BwY8NqvJ+pw=" -> (known after apply)
      ~ id                 = "0102AD-2D118D-FFFFD8/roles/billing.admin/serviceAccount:sa-terraform-net@prj-b-seed-8e7f.iam.gserviceaccount.com" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # google_billing_account_iam_member.billing_admin_user["org"] must be replaced
-/+ resource "google_billing_account_iam_member" "billing_admin_user" {
      ~ billing_account_id = "0102AD-2D118D-FFFFD8" -> jsonencode(
            {
              + billing_project        = "prj-b-seed-8e7f"
              + create_optional_groups = false
              + create_required_groups = false
              + optional_groups        = {
                  + gcp_global_secrets_admin = ""
                  + gcp_kms_admin            = ""
                  + gcp_network_viewer       = ""
                  + gcp_scc_admin            = ""
                  + gcp_security_reviewer    = ""
                }
              + required_groups        = {
                  + audit_data_users     = "gcp-audit-data@deepbreathe.ai"
                  + billing_data_users   = "gcp-billing-data@deepbreathe.ai"
                  + group_billing_admins = "gcp-billing-admins@deepbreathe.ai"
                  + group_org_admins     = "gcp-organization-admins@deepbreathe.ai"
                }
            }
        )
      ~ etag               = "BwY8NqvJ+pw=" -> (known after apply)
      ~ id                 = "0102AD-2D118D-FFFFD8/roles/billing.admin/serviceAccount:sa-terraform-org@prj-b-seed-8e7f.iam.gserviceaccount.com" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # google_billing_account_iam_member.billing_admin_user["proj"] must be replaced
-/+ resource "google_billing_account_iam_member" "billing_admin_user" {
      ~ billing_account_id = "0102AD-2D118D-FFFFD8" -> jsonencode(
            {
              + billing_project        = "prj-b-seed-8e7f"
              + create_optional_groups = false
              + create_required_groups = false
              + optional_groups        = {
                  + gcp_global_secrets_admin = ""
                  + gcp_kms_admin            = ""
                  + gcp_network_viewer       = ""
                  + gcp_scc_admin            = ""
                  + gcp_security_reviewer    = ""
                }
              + required_groups        = {
                  + audit_data_users     = "gcp-audit-data@deepbreathe.ai"
                  + billing_data_users   = "gcp-billing-data@deepbreathe.ai"
                  + group_billing_admins = "gcp-billing-admins@deepbreathe.ai"
                  + group_org_admins     = "gcp-organization-admins@deepbreathe.ai"
                }
            }
        )
      ~ etag               = "BwY8NqvJ+pw=" -> (known after apply)
      ~ id                 = "0102AD-2D118D-FFFFD8/roles/billing.admin/serviceAccount:sa-terraform-proj@prj-b-seed-8e7f.iam.gserviceaccount.com" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # google_billing_account_iam_member.tf_billing_user["bootstrap"] must be replaced
-/+ resource "google_billing_account_iam_member" "tf_billing_user" {
      ~ billing_account_id = "0102AD-2D118D-FFFFD8" -> jsonencode(
            {
              + billing_project        = "prj-b-seed-8e7f"
              + create_optional_groups = false
              + create_required_groups = false
              + optional_groups        = {
                  + gcp_global_secrets_admin = ""
                  + gcp_kms_admin            = ""
                  + gcp_network_viewer       = ""
                  + gcp_scc_admin            = ""
                  + gcp_security_reviewer    = ""
                }
              + required_groups        = {
                  + audit_data_users     = "gcp-audit-data@deepbreathe.ai"
                  + billing_data_users   = "gcp-billing-data@deepbreathe.ai"
                  + group_billing_admins = "gcp-billing-admins@deepbreathe.ai"
                  + group_org_admins     = "gcp-organization-admins@deepbreathe.ai"
                }
            }
        )
      ~ etag               = "BwY8NqvJ+pw=" -> (known after apply)
      ~ id                 = "0102AD-2D118D-FFFFD8/roles/billing.user/serviceAccount:sa-terraform-bootstrap@prj-b-seed-8e7f.iam.gserviceaccount.com" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # google_billing_account_iam_member.tf_billing_user["env"] must be replaced
-/+ resource "google_billing_account_iam_member" "tf_billing_user" {
      ~ billing_account_id = "0102AD-2D118D-FFFFD8" -> jsonencode(
            {
              + billing_project        = "prj-b-seed-8e7f"
              + create_optional_groups = false
              + create_required_groups = false
              + optional_groups        = {
                  + gcp_global_secrets_admin = ""
                  + gcp_kms_admin            = ""
                  + gcp_network_viewer       = ""
                  + gcp_scc_admin            = ""
                  + gcp_security_reviewer    = ""
                }
              + required_groups        = {
                  + audit_data_users     = "gcp-audit-data@deepbreathe.ai"
                  + billing_data_users   = "gcp-billing-data@deepbreathe.ai"
                  + group_billing_admins = "gcp-billing-admins@deepbreathe.ai"
                  + group_org_admins     = "gcp-organization-admins@deepbreathe.ai"
                }
            }
        )
      ~ etag               = "BwY8NqvJ+pw=" -> (known after apply)
      ~ id                 = "0102AD-2D118D-FFFFD8/roles/billing.user/serviceAccount:sa-terraform-env@prj-b-seed-8e7f.iam.gserviceaccount.com" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # google_billing_account_iam_member.tf_billing_user["net"] must be replaced
-/+ resource "google_billing_account_iam_member" "tf_billing_user" {
      ~ billing_account_id = "0102AD-2D118D-FFFFD8" -> jsonencode(
            {
              + billing_project        = "prj-b-seed-8e7f"
              + create_optional_groups = false
              + create_required_groups = false
              + optional_groups        = {
                  + gcp_global_secrets_admin = ""
                  + gcp_kms_admin            = ""
                  + gcp_network_viewer       = ""
                  + gcp_scc_admin            = ""
                  + gcp_security_reviewer    = ""
                }
              + required_groups        = {
                  + audit_data_users     = "gcp-audit-data@deepbreathe.ai"
                  + billing_data_users   = "gcp-billing-data@deepbreathe.ai"
                  + group_billing_admins = "gcp-billing-admins@deepbreathe.ai"
                  + group_org_admins     = "gcp-organization-admins@deepbreathe.ai"
                }
            }
        )
      ~ etag               = "BwY8NqvJ+pw=" -> (known after apply)
      ~ id                 = "0102AD-2D118D-FFFFD8/roles/billing.user/serviceAccount:sa-terraform-net@prj-b-seed-8e7f.iam.gserviceaccount.com" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # google_billing_account_iam_member.tf_billing_user["org"] must be replaced
-/+ resource "google_billing_account_iam_member" "tf_billing_user" {
      ~ billing_account_id = "0102AD-2D118D-FFFFD8" -> jsonencode(
            {
              + billing_project        = "prj-b-seed-8e7f"
              + create_optional_groups = false
              + create_required_groups = false
              + optional_groups        = {
                  + gcp_global_secrets_admin = ""
                  + gcp_kms_admin            = ""
                  + gcp_network_viewer       = ""
                  + gcp_scc_admin            = ""
                  + gcp_security_reviewer    = ""
                }
              + required_groups        = {
                  + audit_data_users     = "gcp-audit-data@deepbreathe.ai"
                  + billing_data_users   = "gcp-billing-data@deepbreathe.ai"
                  + group_billing_admins = "gcp-billing-admins@deepbreathe.ai"
                  + group_org_admins     = "gcp-organization-admins@deepbreathe.ai"
                }
            }
        )
      ~ etag               = "BwY8NqvJ+pw=" -> (known after apply)
      ~ id                 = "0102AD-2D118D-FFFFD8/roles/billing.user/serviceAccount:sa-terraform-org@prj-b-seed-8e7f.iam.gserviceaccount.com" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # google_billing_account_iam_member.tf_billing_user["proj"] must be replaced
-/+ resource "google_billing_account_iam_member" "tf_billing_user" {
      ~ billing_account_id = "0102AD-2D118D-FFFFD8" -> jsonencode(
            {
              + billing_project        = "prj-b-seed-8e7f"
              + create_optional_groups = false
              + create_required_groups = false
              + optional_groups        = {
                  + gcp_global_secrets_admin = ""
                  + gcp_kms_admin            = ""
                  + gcp_network_viewer       = ""
                  + gcp_scc_admin            = ""
                  + gcp_security_reviewer    = ""
                }
              + required_groups        = {
                  + audit_data_users     = "gcp-audit-data@deepbreathe.ai"
                  + billing_data_users   = "gcp-billing-data@deepbreathe.ai"
                  + group_billing_admins = "gcp-billing-admins@deepbreathe.ai"
                  + group_org_admins     = "gcp-organization-admins@deepbreathe.ai"
                }
            }
        )
      ~ etag               = "BwY8NqvJ+pw=" -> (known after apply)
      ~ id                 = "0102AD-2D118D-FFFFD8/roles/billing.user/serviceAccount:sa-terraform-proj@prj-b-seed-8e7f.iam.gserviceaccount.com" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.gcp_projects_state_bucket.data.google_storage_project_service_account.gcs_account will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_storage_project_service_account" "gcs_account" {
      + email_address = (known after apply)
      + id            = (known after apply)
      + member        = (known after apply)
      + project       = "prj-b-seed-8e7f"
    }

  # module.seed_bootstrap.data.google_storage_project_service_account.gcs_account will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_storage_project_service_account" "gcs_account" {
      + email_address = (known after apply)
      + id            = (known after apply)
      + member        = (known after apply)
      + project       = "prj-b-seed-8e7f"
    }

  # module.gh_cicd.module.project-factory.google_project.main will be updated in-place
  ~ resource "google_project" "main" {
      ~ billing_account     = "0102AD-2D118D-FFFFD8" -> jsonencode(
            {
              + billing_project        = "prj-b-seed-8e7f"
              + create_optional_groups = false
              + create_required_groups = false
              + optional_groups        = {
                  + gcp_global_secrets_admin = ""
                  + gcp_kms_admin            = ""
                  + gcp_network_viewer       = ""
                  + gcp_scc_admin            = ""
                  + gcp_security_reviewer    = ""
                }
              + required_groups        = {
                  + audit_data_users     = "gcp-audit-data@deepbreathe.ai"
                  + billing_data_users   = "gcp-billing-data@deepbreathe.ai"
                  + group_billing_admins = "gcp-billing-admins@deepbreathe.ai"
                  + group_org_admins     = "gcp-organization-admins@deepbreathe.ai"
                }
            }
        )
        id                  = "projects/prj-b-cicd-wif-gh-1187"
        name                = "prj-b-cicd-wif-gh"
        # (8 unchanged attributes hidden)
    }

  # module.seed_bootstrap.module.kms[0].google_kms_crypto_key_iam_binding.decrypters[0] will be updated in-place
  ~ resource "google_kms_crypto_key_iam_binding" "decrypters" {
        id            = "projects/prj-b-seed-8e7f/locations/northamerica-northeast2/keyRings/prj-keyring/cryptoKeys/prj-key/roles/cloudkms.cryptoKeyDecrypter"
      ~ members       = [
          - "serviceAccount:service-663843089709@gs-project-accounts.iam.gserviceaccount.com",
        ] -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.seed_bootstrap.module.kms[0].google_kms_crypto_key_iam_binding.encrypters[0] will be updated in-place
  ~ resource "google_kms_crypto_key_iam_binding" "encrypters" {
        id            = "projects/prj-b-seed-8e7f/locations/northamerica-northeast2/keyRings/prj-keyring/cryptoKeys/prj-key/roles/cloudkms.cryptoKeyEncrypter"
      ~ members       = [
          - "serviceAccount:service-663843089709@gs-project-accounts.iam.gserviceaccount.com",
        ] -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.seed_bootstrap.module.seed_project.module.project-factory.google_project.main will be updated in-place
  ~ resource "google_project" "main" {
      ~ billing_account     = "0102AD-2D118D-FFFFD8" -> jsonencode(
            {
              + billing_project        = "prj-b-seed-8e7f"
              + create_optional_groups = false
              + create_required_groups = false
              + optional_groups        = {
                  + gcp_global_secrets_admin = ""
                  + gcp_kms_admin            = ""
                  + gcp_network_viewer       = ""
                  + gcp_scc_admin            = ""
                  + gcp_security_reviewer    = ""
                }
              + required_groups        = {
                  + audit_data_users     = "gcp-audit-data@deepbreathe.ai"
                  + billing_data_users   = "gcp-billing-data@deepbreathe.ai"
                  + group_billing_admins = "gcp-billing-admins@deepbreathe.ai"
                  + group_org_admins     = "gcp-organization-admins@deepbreathe.ai"
                }
            }
        )
        id                  = "projects/prj-b-seed-8e7f"
        name                = "prj-b-seed"
        # (8 unchanged attributes hidden)
    }

Plan: 27 to add, 4 to change, 11 to destroy.

Changes to Outputs:
  ~ common_config                                     = {
      ~ billing_account       = "0102AD-2D118D-FFFFD8" -> jsonencode(
            {
              + billing_project        = "prj-b-seed-8e7f"
              + create_optional_groups = false
              + create_required_groups = false
              + optional_groups        = {
                  + gcp_global_secrets_admin = ""
                  + gcp_kms_admin            = ""
                  + gcp_network_viewer       = ""
                  + gcp_scc_admin            = ""
                  + gcp_security_reviewer    = ""
                }
              + required_groups        = {
                  + audit_data_users     = "gcp-audit-data@deepbreathe.ai"
                  + billing_data_users   = "gcp-billing-data@deepbreathe.ai"
                  + group_billing_admins = "gcp-billing-admins@deepbreathe.ai"
                  + group_org_admins     = "gcp-organization-admins@deepbreathe.ai"
                }
            }
        )
      ~ default_region_gcs    = "US" -> "northamerica-northeast2"
      ~ default_region_kms    = "us" -> "northamerica-northeast2"
        # (8 unchanged attributes hidden)
    }

  ```

  </details>
  
  